In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name": ['Ashish', 'Harry', 'Rohan', 'Subh'],
    "Salary": [92, 34, 24, 17],
    "City": ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [5]:
df.to_csv('data_folder/friends.csv')

In [6]:
# csv file without index
df.to_csv('data_folder/friends_without_index.csv', index=False)

In [7]:
# to show rows from first
df.head(2)

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [8]:
# to show rows from last
df.tail(2)

    name  Salary    City
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [9]:
# to see the max, min, count etc of the numerical columns
df.describe()

         Salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
data_frame = pd.read_csv('data_folder/ashish.csv')

In [11]:
data_frame

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [12]:
data_frame['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [13]:
data_frame['Speed'][0]

12

In [14]:
data_frame['Speed'][0] = 50

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
data_frame

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [16]:
data_frame.to_csv('data_folder/updated_ashish.csv', index=False)

In [17]:
# code to change the index instead of builtin 0,1,2,3
data_frame.index = ['first', 'second', 'third', 'fourth']

In [18]:
data_frame

        Train  Speed     City
first     123     50   Rampur
second    456     23  Kolkata
third     789     34   Jaipur
fourth     12     45    Patna

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.418541
1     0.112363
2     0.733948
3     0.403442
4     0.559098
5     0.168214
6     0.534574
7     0.606872
8     0.803321
9     0.139435
10    0.604552
11    0.647199
12    0.303136
13    0.864862
14    0.846736
15    0.052716
16    0.828761
17    0.696017
18    0.481468
19    0.280583
20    0.327717
21    0.611815
22    0.266692
23    0.827002
24    0.925315
25    0.031288
26    0.394814
27    0.494087
28    0.594326
29    0.097340
30    0.087128
31    0.372251
32    0.049651
33    0.364867
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [25]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [26]:
new_df

            0         1         2         3         4
0    0.166205  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329  0.330540  0.252568  0.302178  0.638855  0.144366
330  0.462610  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [27]:
new_df.head(10)

          0         1         2         3         4
0  0.166205  0.120572  0.653205  0.509853  0.222215
1  0.206073  0.179476  0.670366  0.377200  0.011797
2  0.361301  0.890468  0.869939  0.609430  0.435110
3  0.491512  0.005923  0.933778  0.563535  0.098094
4  0.261787  0.111873  0.015175  0.506034  0.153787
5  0.963291  0.316276  0.835348  0.051215  0.753371
6  0.656215  0.849263  0.980087  0.001283  0.244117
7  0.638911  0.290290  0.495247  0.303434  0.464493
8  0.668488  0.273473  0.516633  0.410818  0.332816
9  0.209406  0.374005  0.321223  0.170031  0.295950

In [28]:
type(new_df)

pandas.core.frame.DataFrame

In [30]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.503359    0.515933    0.497341    0.481209    0.525925
std      0.290561    0.296828    0.283538    0.285532    0.287423
min      0.000654    0.001487    0.001868    0.001283    0.006954
25%      0.252440    0.264684    0.266673    0.247801    0.268622
50%      0.488248    0.516534    0.475063    0.465644    0.538447
75%      0.758806    0.785598    0.744735    0.726187    0.773207
max      0.998039    0.999556    0.993854    0.992802    0.993226

In [32]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
new_df.head()

          0         1         2         3         4
0  0.166205  0.120572  0.653205  0.509853  0.222215
1  0.206073  0.179476  0.670366  0.377200  0.011797
2  0.361301  0.890468  0.869939  0.609430  0.435110
3  0.491512  0.005923  0.933778  0.563535  0.098094
4  0.261787  0.111873  0.015175  0.506034  0.153787

In [34]:
new_df[0][0] = "Ashish"

In [35]:
new_df.head()

          0         1         2         3         4
0    Ashish  0.120572  0.653205  0.509853  0.222215
1  0.206073  0.179476  0.670366  0.377200  0.011797
2  0.361301  0.890468  0.869939  0.609430  0.435110
3  0.491512  0.005923  0.933778  0.563535  0.098094
4  0.261787  0.111873  0.015175  0.506034  0.153787

In [36]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [38]:
# Check the index.
new_df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [39]:
# check the columns
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [40]:
# code to convert a data frame into numpy array.
new_df.to_numpy()

array([['Ashish', 0.12057205509052493, 0.6532049890393479,
        0.5098525892438881, 0.22221459802151333],
       [0.20607283967158074, 0.17947579897882793, 0.670366205183398,
        0.3771996572370887, 0.011797383737469525],
       [0.36130144561698707, 0.8904683956435672, 0.869938543202552,
        0.6094301365255849, 0.4351103202323917],
       ...,
       [0.3462581427202518, 0.5747464975244744, 0.15131078104396412,
        0.0038721153988541257, 0.59635083806315],
       [0.41008525227065296, 0.8175827995777906, 0.9816481294818281,
        0.3864872291550109, 0.6996496057286439],
       [0.18242414240213423, 0.02407131008340202, 0.40275467406126075,
        0.25275079949700285, 0.04004666254635958]], dtype=object)

In [42]:
new_df[0][0] = 2.3

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
new_df.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0         2.3  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]>

In [44]:
# code to transpose a dataframe
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,2.3,0.206073,0.361301,0.491512,0.261787,0.963291,0.656215,0.638911,0.668488,0.209406,...,0.789885,0.0562996,0.140968,0.131111,0.682912,0.33054,0.46261,0.346258,0.410085,0.182424
1,0.120572,0.179476,0.890468,0.00592294,0.111873,0.316276,0.849263,0.29029,0.273473,0.374005,...,0.886581,0.700115,0.341704,0.770258,0.224817,0.252568,0.670701,0.574746,0.817583,0.0240713
2,0.653205,0.670366,0.869939,0.933778,0.0151751,0.835348,0.980087,0.495247,0.516633,0.321223,...,0.209561,0.29737,0.555962,0.799832,0.782631,0.302178,0.421394,0.151311,0.981648,0.402755
3,0.509853,0.3772,0.60943,0.563535,0.506034,0.0512145,0.00128342,0.303434,0.410818,0.170031,...,0.327807,0.398682,0.318586,0.31595,0.262401,0.638855,0.288225,0.00387212,0.386487,0.252751
4,0.222215,0.0117974,0.43511,0.0980939,0.153787,0.753371,0.244117,0.464493,0.332816,0.29595,...,0.263431,0.802504,0.54876,0.66547,0.701384,0.144366,0.33285,0.596351,0.69965,0.0400467

In [45]:
new_df.head()

          0         1         2         3         4
0       2.3  0.120572  0.653205  0.509853  0.222215
1  0.206073  0.179476  0.670366  0.377200  0.011797
2  0.361301  0.890468  0.869939  0.609430  0.435110
3  0.491512  0.005923  0.933778  0.563535  0.098094
4  0.261787  0.111873  0.015175  0.506034  0.153787

In [46]:
#code to sort my data frame according to index descending order
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.182424  0.024071  0.402755  0.252751  0.040047
332  0.410085  0.817583  0.981648  0.386487  0.699650
331  0.346258  0.574746  0.151311  0.003872  0.596351
330   0.46261  0.670701  0.421394  0.288225  0.332850
329   0.33054  0.252568  0.302178  0.638855  0.144366
..        ...       ...       ...       ...       ...
4    0.261787  0.111873  0.015175  0.506034  0.153787
3    0.491512  0.005923  0.933778  0.563535  0.098094
2    0.361301  0.890468  0.869939  0.609430  0.435110
1    0.206073  0.179476  0.670366  0.377200  0.011797
0         2.3  0.120572  0.653205  0.509853  0.222215

[334 rows x 5 columns]

In [48]:
# code to sort the dataframe as per the column.
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.222215  0.509853  0.653205  0.120572       2.3
1    0.011797  0.377200  0.670366  0.179476  0.206073
2    0.435110  0.609430  0.869939  0.890468  0.361301
3    0.098094  0.563535  0.933778  0.005923  0.491512
4    0.153787  0.506034  0.015175  0.111873  0.261787
..        ...       ...       ...       ...       ...
329  0.144366  0.638855  0.302178  0.252568   0.33054
330  0.332850  0.288225  0.421394  0.670701   0.46261
331  0.596351  0.003872  0.151311  0.574746  0.346258
332  0.699650  0.386487  0.981648  0.817583  0.410085
333  0.040047  0.252751  0.402755  0.024071  0.182424

[334 rows x 5 columns]

In [50]:
newdf2 = new_df

In [51]:
newdf2[0][0] = 678

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [52]:
new_df

            0         1         2         3         4
0         678  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [54]:
newdf2

            0         1         2         3         4
0         678  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [55]:
newdf3 = newdf2.copy()

In [56]:
newdf3[0][0] = 'ash'

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [57]:
newdf2

            0         1         2         3         4
0         678  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [58]:
newdf3

            0         1         2         3         4
0         ash  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [59]:
newdf4 = newdf3[:]

In [60]:
newdf4[0][0] = 0.3456

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3343: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

In [61]:
newdf3

            0         1         2         3         4
0      0.3456  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [63]:
new_df

            0         1         2         3         4
0         678  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [64]:
new_df.loc[0,0] = 890

In [65]:
new_df

            0         1         2         3         4
0         890  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [66]:
# code to change the column name
new_df.columns = list('abcde')

In [67]:
new_df

            a         b         c         d         e
0         890  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [68]:
new_df.columns = ['A', 'B', 'c', 'D', 'E']

In [69]:
new_df

            A         B         c         D         E
0         890  0.120572  0.653205  0.509853  0.222215
1    0.206073  0.179476  0.670366  0.377200  0.011797
2    0.361301  0.890468  0.869939  0.609430  0.435110
3    0.491512  0.005923  0.933778  0.563535  0.098094
4    0.261787  0.111873  0.015175  0.506034  0.153787
..        ...       ...       ...       ...       ...
329   0.33054  0.252568  0.302178  0.638855  0.144366
330   0.46261  0.670701  0.421394  0.288225  0.332850
331  0.346258  0.574746  0.151311  0.003872  0.596351
332  0.410085  0.817583  0.981648  0.386487  0.699650
333  0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [71]:
new_df.loc[0, 'A'] = 'Ashish Kumar'

In [72]:
new_df

                A         B         c         D         E
0    Ashish Kumar  0.120572  0.653205  0.509853  0.222215
1        0.206073  0.179476  0.670366  0.377200  0.011797
2        0.361301  0.890468  0.869939  0.609430  0.435110
3        0.491512  0.005923  0.933778  0.563535  0.098094
4        0.261787  0.111873  0.015175  0.506034  0.153787
..            ...       ...       ...       ...       ...
329       0.33054  0.252568  0.302178  0.638855  0.144366
330       0.46261  0.670701  0.421394  0.288225  0.332850
331      0.346258  0.574746  0.151311  0.003872  0.596351
332      0.410085  0.817583  0.981648  0.386487  0.699650
333      0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [73]:
new_df.loc[0, 0] = 567

In [74]:
new_df

                A         B         c         D         E      0
0    Ashish Kumar  0.120572  0.653205  0.509853  0.222215  567.0
1        0.206073  0.179476  0.670366  0.377200  0.011797    NaN
2        0.361301  0.890468  0.869939  0.609430  0.435110    NaN
3        0.491512  0.005923  0.933778  0.563535  0.098094    NaN
4        0.261787  0.111873  0.015175  0.506034  0.153787    NaN
..            ...       ...       ...       ...       ...    ...
329       0.33054  0.252568  0.302178  0.638855  0.144366    NaN
330       0.46261  0.670701  0.421394  0.288225  0.332850    NaN
331      0.346258  0.574746  0.151311  0.003872  0.596351    NaN
332      0.410085  0.817583  0.981648  0.386487  0.699650    NaN
333      0.182424  0.024071  0.402755  0.252751  0.040047    NaN

[334 rows x 6 columns]

In [75]:
# code to drop a column
new_df.drop(0, axis=1)

                A         B         c         D         E
0    Ashish Kumar  0.120572  0.653205  0.509853  0.222215
1        0.206073  0.179476  0.670366  0.377200  0.011797
2        0.361301  0.890468  0.869939  0.609430  0.435110
3        0.491512  0.005923  0.933778  0.563535  0.098094
4        0.261787  0.111873  0.015175  0.506034  0.153787
..            ...       ...       ...       ...       ...
329       0.33054  0.252568  0.302178  0.638855  0.144366
330       0.46261  0.670701  0.421394  0.288225  0.332850
331      0.346258  0.574746  0.151311  0.003872  0.596351
332      0.410085  0.817583  0.981648  0.386487  0.699650
333      0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [77]:
new_df.loc[0,0] = 768

In [78]:
new_df.head()

              A         B         c         D         E      0
0  Ashish Kumar  0.120572  0.653205  0.509853  0.222215  768.0
1      0.206073  0.179476  0.670366  0.377200  0.011797    NaN
2      0.361301  0.890468  0.869939  0.609430  0.435110    NaN
3      0.491512  0.005923  0.933778  0.563535  0.098094    NaN
4      0.261787  0.111873  0.015175  0.506034  0.153787    NaN

In [79]:
#It just drop the value of zero column df.
new_df.drop(0)

            A         B         c         D         E   0
1    0.206073  0.179476  0.670366  0.377200  0.011797 NaN
2    0.361301  0.890468  0.869939  0.609430  0.435110 NaN
3    0.491512  0.005923  0.933778  0.563535  0.098094 NaN
4    0.261787  0.111873  0.015175  0.506034  0.153787 NaN
5    0.963291  0.316276  0.835348  0.051215  0.753371 NaN
..        ...       ...       ...       ...       ...  ..
329   0.33054  0.252568  0.302178  0.638855  0.144366 NaN
330   0.46261  0.670701  0.421394  0.288225  0.332850 NaN
331  0.346258  0.574746  0.151311  0.003872  0.596351 NaN
332  0.410085  0.817583  0.981648  0.386487  0.699650 NaN
333  0.182424  0.024071  0.402755  0.252751  0.040047 NaN

[333 rows x 6 columns]

In [80]:
new_df.drop(0, axis=1)

                A         B         c         D         E
0    Ashish Kumar  0.120572  0.653205  0.509853  0.222215
1        0.206073  0.179476  0.670366  0.377200  0.011797
2        0.361301  0.890468  0.869939  0.609430  0.435110
3        0.491512  0.005923  0.933778  0.563535  0.098094
4        0.261787  0.111873  0.015175  0.506034  0.153787
..            ...       ...       ...       ...       ...
329       0.33054  0.252568  0.302178  0.638855  0.144366
330       0.46261  0.670701  0.421394  0.288225  0.332850
331      0.346258  0.574746  0.151311  0.003872  0.596351
332      0.410085  0.817583  0.981648  0.386487  0.699650
333      0.182424  0.024071  0.402755  0.252751  0.040047

[334 rows x 5 columns]

In [82]:
new_df.head()

              A         B         c         D         E      0
0  Ashish Kumar  0.120572  0.653205  0.509853  0.222215  768.0
1      0.206073  0.179476  0.670366  0.377200  0.011797    NaN
2      0.361301  0.890468  0.869939  0.609430  0.435110    NaN
3      0.491512  0.005923  0.933778  0.563535  0.098094    NaN
4      0.261787  0.111873  0.015175  0.506034  0.153787    NaN

In [83]:
new_df = new_df.drop(0, axis=1)

In [84]:
new_df.head()

              A         B         c         D         E
0  Ashish Kumar  0.120572  0.653205  0.509853  0.222215
1      0.206073  0.179476  0.670366  0.377200  0.011797
2      0.361301  0.890468  0.869939  0.609430  0.435110
3      0.491512  0.005923  0.933778  0.563535  0.098094
4      0.261787  0.111873  0.015175  0.506034  0.153787

In [87]:
#code to get some specific column and row.
new_df.loc[1,'A']

0.20607283967158074

In [88]:
new_df.loc[[1,2],'c']

1    0.670366
2    0.869939
Name: c, dtype: float64

In [89]:
new_df.loc[[1, 2], ['c', 'D']]

          c        D
1  0.670366  0.37720
2  0.869939  0.60943